perpuchaty/MQTT_Geiger_Counter_SW/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c6"
CONFIG_APP_PROJECT_VER="1"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_APP_PROJECT_VER_FROM_CONFIG=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_TWO_OTA_LARGE=y

# BLE (NimBLE) + BluFi provisioning
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_BLUFI_ENABLE=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
# CONFIG_BT_GATTC_ENABLE is not set
# CONFIG_BT_BLE_SMP_ENABLE is not set
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT=n
CONFIG_BT_NIMBLE_SECURITY_ENABLE=n
CONFIG_BT_NIMBLE_CRYPTO_STACK_MBEDTLS=n
CONFIG_MBEDTLS_HARDWARE_MPI=y

# SoftAP captive portal
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# Geiger Counter -> Wi-Fi provisioning
CONFIG_GEIGER_AP_SSID_PREFIX="esp32"
CONFIG_GEIGER_AP_PASSWORD=""
CONFIG_GEIGER_AP_CHANNEL=1
CONFIG_GEIGER_AP_MAX_CONN=4
CONFIG_GEIGER_AP_IP="192.168.4.1"
CONFIG_GEIGER_STA_MAX_RETRY=5
CONFIG_GEIGER_PORTAL_LINGER_MS=60000

# Geiger Counter -> Web UI
CONFIG_GEIGER_MDNS_HOSTNAME="geigercounter"
CONFIG_GEIGER_MDNS_INSTANCE="Geiger Counter"
CONFIG_GEIGER_HTTP_PORT=80

# Geiger Counter -> identity
CONFIG_GEIGER_DEVICE_NAME="Geiger Counter"

# Geiger Counter -> MQTT / Home Assistant (runtime defaults, editable in the web UI)
# CONFIG_GEIGER_MQTT_ENABLED is not set
CONFIG_GEIGER_MQTT_URI="mqtt://homeassistant.local:1883"
CONFIG_GEIGER_MQTT_USER=""
CONFIG_GEIGER_MQTT_PASS=""
CONFIG_GEIGER_MQTT_TOPIC="geiger"
CONFIG_GEIGER_MQTT_HA_DISCOVERY=y
CONFIG_GEIGER_MQTT_HA_PREFIX="homeassistant"
CONFIG_GEIGER_MQTT_INTERVAL_S=30
